In [2]:
import pandas as pd

In [3]:
csv_path = "Budget_data.csv"
budget_data=pd.read_csv(csv_path)
budget_data.head()

       Date  Profit/Losses
0  Jan-2010         867884
1    feb-10         984655
2    mar-10         322013
3  Apr-2010         -69417
4    may-10         310503

In [4]:
budget_data["Date"].sum()

'Jan-2010feb-10mar-10Apr-2010may-10jun-10jul-10Aug-2010sep-10oct-10nov-10Dec-2010Jan-2011feb-11mar-11Apr-2011may-11jun-11jul-11Aug-2011sep-11oct-11nov-11Dec-2011Jan-2012feb-12mar-12Apr-2012may-12jun-12jul-12Aug-2012sep-12oct-12nov-12Dec-2012Jan-2013feb-13mar-13Apr-2013may-13jun-13jul-13Aug-2013sep-13oct-13nov-13Dec-2013Jan-2014feb-14mar-14Apr-2014may-14jun-14jul-14Aug-2014sep-14oct-14nov-14Dec-2014Jan-2015feb-15mar-15Apr-2015may-15jun-15jul-15Aug-2015sep-15oct-15nov-15Dec-2015Jan-2016feb-16mar-16Apr-2016may-16jun-16jul-16Aug-2016sep-16oct-16nov-16Dec-2016Jan-2017feb-17'

In [50]:
total_months=len(budget_data ["Date"].value_counts())
total_months
"Total months: {}".format(total_months)

'Total months: 86'

In [52]:
total_profit=budget_data["Profit/Losses"].sum()
"Total profit: ${}".format(total_profit)

'Total profit: $38382578'

In [69]:
percent_change=budget_data["Profit/Losses"].diff()
percent_change

0          NaN
1     116771.0
2    -662642.0
3    -391430.0
4     379920.0
        ...
81   -665765.0
82    693229.0
83   -734926.0
84     77242.0
85    532869.0
Name: Profit/Losses, Length: 86, dtype: float64

In [76]:
avg_change=percent_change.mean()
avg_change
"Average change: {}".format(avg_change)

'Average change: -2315.1176470588234'

In [80]:
budget_data["Average change"]=percent_change
budget_data

        Date  Profit/Losses  Average change
0   Jan-2010         867884             NaN
1     feb-10         984655        116771.0
2     mar-10         322013       -662642.0
3   Apr-2010         -69417       -391430.0
4     may-10         310503        379920.0
..       ...            ...             ...
81    oct-16         102685       -665765.0
82    nov-16         795914        693229.0
83  Dec-2016          60988       -734926.0
84  Jan-2017         138230         77242.0
85    feb-17         671099        532869.0

[86 rows x 3 columns]

In [86]:
greatest_increase=percent_change.max()
greatest_increase
"Greatest increase in profit: ${}".format(greatest_increase)

'Greatest increase in profit: $1926159.0'

In [87]:
greatest_decrease=percent_change.min()
greatest_decrease
"Greatest decrease in profit: ${}".format(greatest_decrease)

'Greatest decrease in profit: $-2196167.0'

In [88]:
budget_data.loc[budget_data['Average change'] == 1926159.0]

      Date  Profit/Losses  Average change
25  feb-12        1170593       1926159.0

In [89]:
budget_data.loc[budget_data['Average change'] == -2196167.0]

      Date  Profit/Losses  Average change
44  sep-13       -1196225      -2196167.0

In [91]:
print("Financial Analysis")
print("----------------------")
print("Total months: {}".format(total_months))
print("Average change: {}".format(avg_change))
print("Greatest increase in profit: feb-12 (${})".format(greatest_increase))
print("Greatest decrease in profit: sep-13 (${})".format(greatest_decrease))

Financial Analysis
----------------------
Total months: 86
Average change: -2315.1176470588234
Greatest increase in profit: feb-12 ($1926159.0)
Greatest decrease in profit: sep-13 ($-2196167.0)

In [ ]:
budget_Data.to_excel("../homework_solved.xlsx", index=False)